Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: ཙན་དན་གྱི་སྟོབས་ཀྱི་བདེ་བསིལ་ལ་མངོན་པར་རྩེ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the play of the pleasant cooling strength of sandalwood.

source: མིག་མི་འཛུམས་པར་སྨྲ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called speaking without closing the eyes.

source: ཀུ་མུ་ད་དང་། ཟླ་བ་ལྟ་བུའི་ཆུ་དང་ལྡན་པ་ལ་མངོན་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called play replete with the water like the kumuda flower and the moon.

source: སྤྲུལ་པོ་ཆེ་ལ་སོགས་པའི་ལུས་ལ་མངོན་པར་འདོད་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in desire for great emanation bodies and the like.

source: བསྔགས་པར་བྱ་བ་ཤིན་ཏུ་མང་བ་ལ་མངོན་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called engaging in exceptional praise.

source: བཅུ་པོ་དེ་དག་ནི་མངོན་པར་རྩེ་བའི་རིན་པོ་ཆེའི་མཛོད་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called entering the precious storehouse of play.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་རིགས་བཙུན་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Pure Venerable Family made offerings to the Bhagavān and uttered this verse:

source: འཇིག་རྟེན་གསུམ་གྱི་ཆོས་ཀྱི་དབང་ཕྱུག་པོ། །དེ་བཞིན་གཤེགས་པ་ཆོས་སྐུ་རྟག་གྱུར་པ། །སེམས་ཅན་རྣམས་ལ་ཕན་པ་མཛད་སླད་དུ། །ལམ་རྣམས་རྣམ་པ་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: “Dharma Lord of the three realms, Tathāgata, permanent Dharma-body, To benefit all sentient beings You teach the various aspects of all the paths.”

source: མངོན་པར་རྩེ་བ་རིན་པོ་ཆེའི་མཛོད་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་གསུམ་པའོ།། །།
en: This concludes the twenty-third chapter, on the topic of entering the precious storehouse of play.

source: ནམ་མཁའ་ལྡིང་གི་རྩལ་ཆེན་པོའི་སྟོབས་ལ་མངོན་པར་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called engaging in the garuḍa’s great potent strength.”

source: ནོར་རྒྱས་ཀྱི་བུའི་སྟོབས་རབ་ཏུ་འཇོམས་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called king of the magical manifestation that completely overcomes the strength of the nāga king#19Vāsuki.

source: རང་གི་སྟོབས་མངོན་པར་སྟོན་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the display of one’s own strength.

source: སྒྲ་ལ་མངོན་པར་རབ་ཏུ་དགའ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the enjoyment of sound.

source: ཆུའི་རླབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering the waves.

source: རྒྱ་མཚོའི་དུས་ཀྱི་ང་རྒྱལ་གྱི་རྒྱགས་པ་མེད་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called causing the rising tide to not be filled with pride.

source: རི་བོའི་རྒྱལ་པོའི་ཕུག་ཏུ་མངོན་པར་སྒྲོགས་པའི་དུས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering the time of resounding within the cave of the king of mountains.

source: རླུང་གི་མཆོག་གི་དུས་ཀྱི་ཕྱོགས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering the direction of the supreme season of wind.

source: མིག་རྒྱང་རིང་བར་སྟོན་པ་ངེས་པར་སེམས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the ascertainment that reveals faraway objects to the sight.

source: མྱུར་དུ་གདུག་པའི་སྦྲུལ་ལ་རྩེ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called play of the snake with fast-acting poison.

source: རིན་པོ་ཆེའི་འོད་ཟེར་བཟང་པོའི་སྟོབས་འཐོབ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called engaging in obtaining the excellent strength of precious light-rays.

source: བཅུ་པོ་དེ་དག་ནི་ནམ་མཁའ་ལྡིང་གི་རྩལ་ཆེན་པོའི་སྟོབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called engaging in the garuḍa’s great potent strength.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་དྲི་མ་མེད་པ་ཟབ་མོ་ལ་འཇུག་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Entering Profound Stainlessness paid homage to the Bhagavān and uttered this verse:

source: ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དབང་པོའི་རྡོ་རྗེ་ཕྱག་ན་བསྣམས། །ཆོས་ཀྱི་དབང་ཕྱུག་ཡེ་ཤེས་སྟོང་གཟིགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Holder of the vajra of the powers of samādhi and wisdom, Lord of Dharma who perceives the gnosis of emptiness, I pay homage to you.

source: ཉོན་མོངས་ལྷ་མ་ཡིན་རྣམས་གཡུལ་དུ་ངེས་པར་རབ་བཅོམ་ནས། །ཆོས་ཀྱི་དབང་པོ་ཆེན་པོའི་ཏོག་ནི་ཁྱོད་ཀྱིས་ལེགས་པར་བཙུགས། །
en: Having obtained complete and certain victory in the battle with the afflictions and asuras, You have planted well the great victory banner of Dharma.”

source: ནམ་མཁའ་ལྡིང་གི་རྩལ་ཆེན་པོའི་སྟོབས་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་བཞི་པའོ།། །།
en: This concludes the twenty-fourth chapter, on the topic of engaging in the garuḍa’s great potent strength.

source: སྒྲ་ཆེན་པོའི་དུས་རྣམ་པར་བསྒྲགས་པ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called king of the manifestation of the proclamation of the time of the great roar.”

source: ཟླ་མེད་པའི་སྟོབས་ཟབ་མོའི་ཚུལ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called manifestation of the profound way of matchless strength.

source: ཚུལ་ཁྲིམས་བརྟན་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called manifestation of constant discipline.

source: ཚུལ་ཁྲིམས་ཀྱི་སྟོབས་ཀྱི་འོད་འཕྲོ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the radiant light of the strength of discipline.

source: ཚུལ་ཁྲིམས་ཀྱི་མཚམས་བཟང་པོ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called manifestation of the excellent bounds of discipline.

source: རིན་པོ་ཆེའི་འོ་མ་འཛག་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called manifestation of the trickle of precious milk.

source: བསོད་ནམས་ཀྱི་རྒྱུན་འཛག་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called manifestation of the trickling flow of merit.

source: བྱམས་པའི་སྟོབས་འཛག་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called manifestation of the trickling strength of loving-kindness.

source: སྙིང་རྗེའི་སྟོབས་འཛག་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called manifestation of the trickling strength of compassion.

source: དགའ་བའི་སྟོབས་འཛག་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called manifestation of the trickling strength of joy.

source: བཏང་སྙོམས་ཀྱི་སྟོབས་འཛག་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called manifestation of the trickling strength of equanimity.

source: བཅུ་པོ་དེ་དག་ནི་སྒྲ་ཆེན་པོའི་དུས་རྣམ་པར་བསྒྲགས་པ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called king of the manifestation of the proclamation of the time of the great roar.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་རིན་ཆེན་དཔལ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Precious Glory paid homage to the Bhagavān and uttered this verse:

source: དེ་བཞིན་གཤེགས་རྒྱལ་མི་ཕྱེད་སྐུ་མངའ་བ། །མཐའ་ཡས་སྟོབས་ལྡན་ཁྱོད་ལ་རྟག་ཕྱག་འཚལ། །
en: “I constantly pay homage to you, Tathāgata, who possesses The immutable body of a conqueror and is endowed with infinite strength.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པ་མཛད་སླད་དུ། །བཀོད་པ་རྣམ་པ་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: You reveal these manifold manifestations To benefit all sentient beings.”

source: སྒྲ་ཆེན་པོའི་དུས་རྣམ་པར་བསྒྲགས་པ་བཀོད་པའི་རྒྱལ་པོའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་ལྔ་པའོ།། །།
en: This concludes the twenty-fifth chapter, on the topic of the king of the manifestation of the proclamation of the time of the great roar.

source: མི་འཇིགས་པ་ཆེན་པོའི་སྟོབས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called engaging in the magical manifestation of the strength of great fearlessness.”

source: རྒྱ་མཚོའི་སྟོབས་ཀྱི་དུས་ལ་མི་འཇིགས་པའི་སྟོབས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called engaging in the magical manifestation of the strength of fearlessness in the strong ocean tide.

source: འཇིགས་པ་མེད་པའི་རྣམ་པའི་རྩ་བ་ལ་དགའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called delighting in the root of fearlessness.

source: མཁས་པའི་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called precious storehouse of skillfulness.

source: མཁས་པའི་དཔལ་གྱི་ལུས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called glorious body of skillfulness.

source: མཁས་པ་གཙང་སྦྲ་ལ་དགའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called delighting in the cleanliness of skillfulness.

source: མཁས་པའི་གཟི་བརྗིད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་ལ་འཇུག་པའི་སྟོབས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called strength of engaging in adornment with the ornament of the brilliance of skillfulness.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ལ་མཁས་པའི་དུས་ཚོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the season of skill in all precious substances.

source: མཁས་པའི་རབ་ཏུ་དགའ་བ་ལ་འཇུག་པར་དགའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called delighting in engaging in the joys of skillfulness.

source: མཁས་པའི་འོད་འཕྲོ་བ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called endowed with the radiant light of skillfulness.

source: མཁས་པའི་གློག་གི་འོད་ཀྱི་རྣམ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called king of the luminous aspect of the lightning of skillfulness.

source: བཅུ་པོ་དེ་དག་ནི་མི་འཇིགས་པ་ཆེན་པོའི་སྟོབས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called engaging in the magical manifestation of the strength of great fearlessness.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་རིན་ཆེན་མེ་ཏོག་ཅེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Precious Flower paid homage to the Bhagavān and uttered this verse:

source: དུས་ཚོད་རྣམ་དག་ཡོན་ཏན་གྱི། །འབྱུང་གནས་ཟབ་མོ་གསང་བའི་མཚོ། །
en: “The source of the tide of pure virtuous qualities Is the deep ocean of secrets.

source: སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: You teach these various doctrines To serve as medicine for all sentient beings.”

source: མི་འཇིགས་པ་ཆེན་པོའི་སྟོབས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་དྲུག་པའོ།། །།
en: This concludes the twenty-sixth chapter, on the topic of engaging in the magical manifestation of the strength of great fearlessness.

source: གནས་ཀྱི་རྣམ་པ་དང་བཅས་པ་ཡངས་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called vastness having aspects of an abode.”

source: གནས་སྲུང་བ་ཞི་བའི་དུས་ཚོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called tranquil time of guarding the abode.

source: ཡང་དག་པའི་སྙིང་པོའི་གནས་ཀྱི་ལམ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called path of the abode of the true essence.

source: ཆུའི་གྲགས་པའི་དེ་ཁོ་ནའི་སྙིང་པོའི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abode of the essence of the renowned reality of water.

source: གྲུབ་པ་བསྔགས་པའི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abode of praising accomplishment.

source: གྲགས་པ་སྙིང་པོའི་རྣམ་པའི་མཚམས་བཟང་པོའི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abode of the excellent limit of the essence of renown.

source: རྟག་ཏུ་དགའ་བ་རྒྱས་པའི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abode of extensive, constant joy.

source: གཞི་ནས་སྐྱེས་པའི་སྟོབས་ཀྱི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abode of strength that arises from the basis.

source: སྙིང་རྗེའི་སྟོབས་ཀྱི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abode of the strength of compassion.

source: བཟོད་པ་ལ་ངེས་པར་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abiding definitively in patience.

source: རྟག་ཏུ་གཙང་བའི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called abode of constant purity.

source: བཅུ་པོ་དེ་དག་ནི་གནས་ཀྱི་རྣམ་པ་དང་བཅས་པ་ཡངས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called vastness having aspects of an abode.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་རིན་པོ་ཆེའི་རིགས་ཀྱི་འོད་ཅེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Light of Precious Family paid homage to the Bhagavān and uttered this verse:

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་སྐུ། །ཡེ་ཤེས་ཡོན་ཏན་འབྱུང་གནས་མཛེས། །
en: “Tathāgata, your gnosis body Is the beautiful source of the virtuous qualities of gnosis.

source: གནས་ཀྱི་རྣམ་པ་དང་བཅས་པ་ཡངས་པའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་བདུན་པའོ།། །།
en: This concludes the twenty-seventh chapter, on the topic of the gateway of vastness having aspects of an abode.

source: ལྷག་པའི་བསམ་པའི་ཆོ་ག་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called engaging in the procedures of superior intention.”

source: མཚམས་བཟང་པོ་ལ་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called abiding at the excellent limit.

source: ལྷག་པའི་བསམ་པའི་ཆོ་ག་ཤེས་པའི་རྒྱ་མཚོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called oceanic seal of knowledge of the rites of the superior intention.

source: ཡེ་ཤེས་ཀྱི་དུས་ཚོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called tide of gnosis.

source: འགྲོ་བའི་དུས་ཚོད་ཀྱི་ཆོ་འཕྲུལ་གྱི་ལྷག་པའི་བསམ་པའི་ཆོ་ག་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the rites of the superior intention of the miraculous display of the tide of migrating beings.

source: ནམ་མཁའ་དང་མཉམ་པར་མངོན་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called play equal to space.

source: མི་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called nonabiding.

source: མངོན་པར་རྒྱུ་བ་བསགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called gathering of proliferations.

source: བསྙེན་པར་འོས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of being worthy of service.

source: སྦྱིན་པར་དགའ་བ་ལ་མངོན་པར་མོས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called resolve to delight in generosity.

source: སེམས་དགེ་ཞིང་ལྷག་པའི་བསམ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called engaging in the superior intention with a happy mind.

source: བཅུ་པོ་དེ་དག་ནི་ལྷག་པའི་བསམ་པའི་ཆོ་ག་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called engaging in the procedures of superior intention.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་ཤེས་པས་རྒྱས་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Vast with Knowledge paid homage to the Bhagavān and uttered this verse:

source: བཅོམ་ལྡན་སངས་རྒྱས་བལྟར་མི་གདའ། །ནམ་མཁའ་མཚུངས་ཤིང་འདྲ་བ་ལགས། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །སྣང་བ་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: “Peerless bhagavān Buddha, Similar and equal to space, You display these various appearances To serve as medicine for all sentient beings.”

source: ལྷག་པའི་བསམ་པའི་ཆོ་ག་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་བརྒྱད་པའོ།། །།
en: This concludes the twenty-eighth chapter, on the topic of engaging in the procedures of superior intention.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། དམག་ཆེན་པོ་དཔའ་བའི་རྒྱལ་པོའི་སྟོབས་བཀོད་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called manifestation of the strength of the heroic king of the great army.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དཔའ་བོ་རྣམ་པར་རྒྱལ་བའི་ཞིང་གི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called field of the completely victorious hero.

source: དཔའ་བར་འགྲོ་བ་ཕུན་སུམ་ཚོགས་པའི་རྗེས་ལས་སྐྱེས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called taking birth after perfecting heroic progress.

source: དཔའ་བོ་རྣམ་པར་རྩེ་བའི་དམིགས་པ་ལ་མཁས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of skill in perceiving the hero’s play.

source: དཔའ་བོའི་ཚུལ་ལ་འཇུག་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ལ་བྱ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called performing the deeds that perfect the strength of entering into the heroic manner.

source: གཡུལ་ངོར་དཔའ་བའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of the hero on the battlefield.

source: སྙིང་སྟོབས་ཕུན་སུམ་ཚོགས་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of the perfection of strong-heartedness.

source: ཡེ་ཤེས་བརྟན་པ་དཔའ་བོའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of the hero with steadfast gnosis.

source: ལེ་ལོའི་དུས་སུ་དཔའ་བོའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of the hero in times of laziness.

source: གཟི་བརྗིད་ཀྱི་སྟོབས་ཀྱི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of brilliant strength.

source: དཔའ་བོའི་གློག་གི་འོད་ཀྱི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of the hero’s lightning.

source: དཔའ་བོའི་ཐོག་ཏོག་གི་དམག་གི་ལག་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called limbs of the army of the hero’s hail.

source: བཅུ་པོ་དེ་དག་ནི་དམག་ཆེན་པོ་དཔའ་བའི་རྒྱལ་པོའི་སྟོབས་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: These ten are the Dharma gateways called manifestation of the strength of the heroic king of the great army.”

source: །དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་དཔའ་བརྟན་བརྟུལ་ཞུགས་ངེས་པ་ལ་ཉེ་བར་གནས་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །དཔའ་ཆེན་མི་ཕྱེད་འཁོར་དང་ལྡན། །ཆོས་ཀྱི་དམག་གི་འདྲེན་པ་པོ།
en: At that time, a devaputra named Abides in the Certainty of the Hero’s Steadfast Asceticism made offerings to the Bhagavān and uttered this verse: “Great hero, with your undiminishing retinue, You are the leader of the army of Dharma.

source: །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །བདུད་གཞོམ་པ་ཡང་སྟོན་པ་མཛད།
en: You once again show your victory over Māra To serve as medicine for all sentient beings.”

source: །དམག་ཆེན་པོ་དཔའ་བའི་རྒྱལ་པོ་སྟོབས་བཀོད་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་དགུ་པའོ།། །།
en: This concludes the twenty-ninth chapter, on the manifestation of the strength of the heroic king of the great army.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། བཟང་པོའི་རྣམ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called becoming the king of the magical manifestation of the aspects of excellence.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བཟང་པོ་རིན་པོ་ཆེའི་རྣམ་པའི་དུས་ཚོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called time of the jewel of excellence.

source: བཟང་པོ་དང་བའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of excellent faith.

source: བཟང་པོའི་རྣམ་པའི་སྟོབས་ཀྱིས་མངོན་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called play manifested through the power of the aspect of excellence.

source: བཟང་པོའི་ནོར་གྱི་གནས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called store of the wealth of excellence.

source: བཟང་པོ་ཕུན་སུམ་ཚོགས་པའི་ལུས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called body of perfect excellence.

source: བཟང་པོའི་གཙང་སྦྲ་ལ་ངེས་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of certainty in the purity of excellence.

source: བཟང་པོའི་གློག་གི་འོད་འཕྲོ་བའི་རྒྱལ་པོའི་མཛོད་ཀྱི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called royal storehouse of the radiant light of the lightning of excellence.

source: བཟང་པོའི་རྣམ་པས་ལེགས་པར་བརྒྱན་པའི་བློ་གྲོས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called intellect that is well adorned with the aspects of excellence.

source: བཅུ་པོ་དེ་དག་ནི་བཟང་པོའི་རྣམ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: These ten are the Dharma gateways called becoming the king of the magical manifestation of the aspects of excellence.”

source: །དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་བཟང་སྐྱོང་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །བཟང་པོའི་མཚན་རྣམས་ཕུན་སུམ་ཚོགས། །བཟང་པོའི་གདན་ལ་རབ་ཏུ་བཞུགས།
en: At that time, a devaputra named Protector of Excellence made offerings to the Bhagavān and uttered this verse: “With all the marks of excellence perfectly complete, You take your seat on the throne of excellence.

source: །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད།
en: You teach these various doctrines To serve as medicine for all sentient beings.”

source: །བཟང་པོའི་རྣམ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་པའོ།། །།
en: This concludes the thirtieth chapter, on the topic of becoming the king of the magical manifestation of the aspects of excellence.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་དཔུང་བསྐྱེད་པ་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called engaging in marshalling the force that reveals the correct concealment associated with play.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགའ་བས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called correct concealment associated with the play of joy.

source: མགུ་བས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called correct concealment associated with the play of delight.

source: མཆོག་ཏུ་དགའ་བས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called correct concealment associated with the play of supreme delight.

source: མངོན་པར་ཞུགས་པའི་རྣམ་པས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called correct concealment associated with the play of the aspect of entry.

source: སེང་གེའི་སྒྲས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called correct concealment associated with the play of the lion’s roar.

source: ཚུལ་གྱིས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་དཔུང་བསྐྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called marshalling the force that reveals the correct concealment associated with the play of conduct.

source: བྱམས་པས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་སྟོབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the strength of revealing the correct concealment associated with the play of loving-kindness.

source: སྙིང་རྗེས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་སྟོབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the strength of revealing the correct concealment associated with the play of compassion.
